#!/usr/bin/env sh

VERSION="$(cat "ВЕРСІЯ")"
  
rm -rf ".будування/$VERSION"

докс перетворити --вхід=документація --вихід=".будування/$VERSION/документація" --вигляд=тема --ґтег=G-0PFF0HTWKB
докс перетворити --вхід=організація --вихід=".будування/організація" --вигляд=тема --ґтег=G-0PFF0HTWKB
докс перетворити --вхід=часопис --вихід=".будування/часопис" --вигляд=тема --ґтег=G-0PFF0HTWKB
докс перетворити --вхід=інформація --вихід=".будування/інформація" --вигляд=тема --ґтег=G-0PFF0HTWKB  
cp -a ресурси index.html 404.html .будування
докс карта --вхід=.будування --вихід=.будування --домен=мавка.укр
find .будування -type f -name "*.html" -exec sed -i "s/{{ВЕРСІЯ_МАВКИ}}/$VERSION/g" {} \;