#!/usr/bin/env sh

VERSION="$(cat "ВЕРСІЯ")"

rm -rf ".будування/$VERSION"

докс перетворити --вхід=документація --вихід=".будування/$VERSION/документація" --вигляд=тема
докс перетворити --вхід=організація --вихід=".будування/організація" --вигляд=тема
докс перетворити --вхід=інформація --вихід=".будування/інформація" --вигляд=тема
докс перетворити --вхід=архів --вихід=".будування/архів" --вигляд=тема
докс перетворити --вхід=часопис --вихід=".будування/часопис" --вигляд=тема
cp -a ресурси index.html 404.html .xdocssitemapignore robots.txt .будування
докс карта --вхід=.будування --вихід=.будування --домен=мавка.укр
find .будування -type f -name "*.html" -exec sed -i "s/{{ВЕРСІЯ_МАВКИ}}/$VERSION/g" {} \;
find .будування -type f -name "*.html" -exec sed -i "s/{{МІТКА_ЧАСУ}}/$(date +%s)/g" {} \;